[
    {
        "id": "ridingcities",
        "title": "Riding Cities",
        "imageUrl": "Riding-cities.webp",
        "description": "Update the Riding Cities Internet page: Creation of a new section, “The founding members”, with the names and photos of the creators of the association. Modification of the section including the button “Download the course schedule” to add a title and two buttons allowing you to download two different lesson schedules (one for children and one for adults).",
        "code": "https://github.com/Epouvaantail/Projet_2",
        "site": "https://epouvaantail.github.io/Projet_2",
        "languages": "HTML5 CSS3"
    },
    {
        "id": "booki",
        "title": "Booki",
        "imageUrl": "Booki.webp",
        "description": "The company wants to develop a website that allows users to find accommodation and activities in the city of their choice. Integrate the site interface with HTML and CSS code. Collaboration with the CTO and the UI designer.",
        "code": "https://github.com/Epouvaantail/Projet_3",
        "site": "https://epouvaantail.github.io/Projet_3",
        "languages": "HTML5 CSS3 Responsive"
    },
    {
        "id": "ohmyfood",
        "title": "OhMyFood",
        "imageUrl": "Ohmyfood.webp",
        "description": "The mission is to develop a “mobile first” site that lists the menus of gourmet restaurants. In addition to traditional reservation systems, customers will be able to compose the menu for their meal so that the dishes are ready upon their arrival.",
        "code": "https://github.com/Epouvaantail/Projet_4",
        "site": "https://epouvaantail.github.io/Projet_4",
        "languages": "HTML5 CSS3 Sass Responsive Animations"
    },
    {
        "id": "printit",
        "title": "Print It",
        "imageUrl": "Printit.webp",
        "description": "Amélioration d'un site statique (HTML CSS) d'une imprimerie en y ajoutant un carousel à défilement automatique et manuel.",
        "code": "https://github.com/Epouvaantail/Projet_5",
        "site": "https://epouvaantail.github.io/Projet_5",
        "languages":"HTML5 CSS3 JavaScript"
    },
    {
        "id": "sophiebluel",
        "title": "Portfolio Sophie Bluel",
        "imageUrl": "SophieBluel.webp",
        "description": "Creation of the presentation page of the architect's work (from the HTML provided), the login page of the site administrator (the client) (code to be created from scratch); and creation of the modal allowing new media to be uploaded (code to be created from scratch).",
        "code": "https://github.com/Epouvaantail/Projet_6",
        "site": null,
        "languages": "HTML5 CSS3 JavaScript NodeJS"
    },
    {
        "id": "kasa",
        "title": "Kasa",
        "imageUrl": "Kasa.webp",
        "description": "Development of a real estate rental application in React, and React components, React Router routes, following Figma models (responsive).",
        "code": "https://github.com/Epouvaantail/Projet_8",
        "site": null,
        "languages": "HTML5 CSS3 JavaScript JSON REACT JSX ReactRouter"
    },
    {
        "id": "ninacarducci",
        "title": "Portfolio Nina Carducci",
        "imageUrl": "Nina-Carducci.webp",
        "description": "Overall optimization of the site both in terms of performance and SEO. Local SEO using Schema.org Metas for social media Site accessibility Local SEO Detailed optimization report",
        "code": "https://github.com/Epouvaantail/Projet_9",
        "site": "https://epouvaantail.github.io/Projet_9",
        "languages": "HTML5 CSS3 JavaScript SEO Wave Schema.org Responsive Lighthouse"
    },
    {
        "id": "events",
        "title": "724 Events",
        "imageUrl": "724-events.webp",
        "description": "The website is functional, but a few bugs hinder proper use by visitors. Research and correction of bugs that impact the user experience, both visually and functionally. Which can also impact the SEO of the company's websites.",
        "code": "https://github.com/Epouvaantail/Projet_10",
        "site": null,
        "languages": "HTML5 CSS3 JavaScript Wave"
    },
    {
        "id": "argentbank",
        "title": "ArgentBank",
        "imageUrl": "Argent-bank.webp",
        "description": "Create the complete and responsive web application with React and use Redux to manage the state of the entire application. Features: User can visit home page; it can connect to the system; he can log out of the system; he can only see information relating to his own profile if he has successfully logged in; he cannot modify his first or last name, but he can modify his nickname.",
        "code": "https://github.com/Epouvaantail/Projet_11",
        "site": null,
        "languages": "HTML5 CSS3 JavaScript NodeJS REACT JSX ReactRouter Redux MongoDB DevTools"
    }
]